; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=411, out_folder=htg/blocksworld/training, instance_id=97, seed=2121, goal_proportion=0.03

(define (problem blocksworld-97)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 b37 b38 b39 b40 b41 b42 b43 b44 b45 b46 b47 b48 b49 b50 b51 b52 b53 b54 b55 b56 b57 b58 b59 b60 b61 b62 b63 b64 b65 b66 b67 b68 b69 b70 b71 b72 b73 b74 b75 b76 b77 b78 b79 b80 b81 b82 b83 b84 b85 b86 b87 b88 b89 b90 b91 b92 b93 b94 b95 b96 b97 b98 b99 b100 b101 b102 b103 b104 b105 b106 b107 b108 b109 b110 b111 b112 b113 b114 b115 b116 b117 b118 b119 b120 b121 b122 b123 b124 b125 b126 b127 b128 b129 b130 b131 b132 b133 b134 b135 b136 b137 b138 b139 b140 b141 b142 b143 b144 b145 b146 b147 b148 b149 b150 b151 b152 b153 b154 b155 b156 b157 b158 b159 b160 b161 b162 b163 b164 b165 b166 b167 b168 b169 b170 b171 b172 b173 b174 b175 b176 b177 b178 b179 b180 b181 b182 b183 b184 b185 b186 b187 b188 b189 b190 b191 b192 b193 b194 b195 b196 b197 b198 b199 b200 b201 b202 b203 b204 b205 b206 b207 b208 b209 b210 b211 b212 b213 b214 b215 b216 b217 b218 b219 b220 b221 b222 b223 b224 b225 b226 b227 b228 b229 b230 b231 b232 b233 b234 b235 b236 b237 b238 b239 b240 b241 b242 b243 b244 b245 b246 b247 b248 b249 b250 b251 b252 b253 b254 b255 b256 b257 b258 b259 b260 b261 b262 b263 b264 b265 b266 b267 b268 b269 b270 b271 b272 b273 b274 b275 b276 b277 b278 b279 b280 b281 b282 b283 b284 b285 b286 b287 b288 b289 b290 b291 b292 b293 b294 b295 b296 b297 b298 b299 b300 b301 b302 b303 b304 b305 b306 b307 b308 b309 b310 b311 b312 b313 b314 b315 b316 b317 b318 b319 b320 b321 b322 b323 b324 b325 b326 b327 b328 b329 b330 b331 b332 b333 b334 b335 b336 b337 b338 b339 b340 b341 b342 b343 b344 b345 b346 b347 b348 b349 b350 b351 b352 b353 b354 b355 b356 b357 b358 b359 b360 b361 b362 b363 b364 b365 b366 b367 b368 b369 b370 b371 b372 b373 b374 b375 b376 b377 b378 b379 b380 b381 b382 b383 b384 b385 b386 b387 b388 b389 b390 b391 b392 b393 b394 b395 b396 b397 b398 b399 b400 b401 b402 b403 b404 b405 b406 b407 b408 b409 b410 b411 - object)
 (:init 
    (arm-empty)
    (clear b111)
    (on b111 b301)
    (on b301 b186)
    (on b186 b401)
    (on-table b401)
    (clear b82)
    (on b82 b240)
    (on b240 b392)
    (on b392 b349)
    (on b349 b383)
    (on-table b383)
    (clear b390)
    (on b390 b229)
    (on b229 b398)
    (on b398 b332)
    (on b332 b183)
    (on b183 b315)
    (on-table b315)
    (clear b128)
    (on b128 b223)
    (on b223 b340)
    (on b340 b317)
    (on b317 b66)
    (on b66 b59)
    (on b59 b308)
    (on b308 b99)
    (on-table b99)
    (clear b318)
    (on-table b318)
    (clear b294)
    (on b294 b11)
    (on b11 b356)
    (on b356 b46)
    (on b46 b69)
    (on-table b69)
    (clear b146)
    (on b146 b7)
    (on b7 b266)
    (on b266 b375)
    (on b375 b42)
    (on b42 b196)
    (on b196 b195)
    (on b195 b136)
    (on b136 b90)
    (on b90 b68)
    (on b68 b331)
    (on b331 b291)
    (on b291 b191)
    (on b191 b359)
    (on b359 b1)
    (on b1 b162)
    (on b162 b329)
    (on b329 b18)
    (on b18 b232)
    (on b232 b91)
    (on b91 b202)
    (on b202 b265)
    (on b265 b119)
    (on b119 b56)
    (on-table b56)
    (clear b299)
    (on b299 b150)
    (on b150 b78)
    (on-table b78)
    (clear b168)
    (on b168 b389)
    (on b389 b254)
    (on-table b254)
    (clear b264)
    (on b264 b258)
    (on b258 b382)
    (on b382 b94)
    (on-table b94)
    (clear b284)
    (on-table b284)
    (clear b152)
    (on-table b152)
    (clear b262)
    (on b262 b185)
    (on b185 b155)
    (on b155 b87)
    (on b87 b231)
    (on b231 b385)
    (on b385 b96)
    (on b96 b408)
    (on-table b408)
    (clear b32)
    (on-table b32)
    (clear b177)
    (on b177 b60)
    (on b60 b35)
    (on-table b35)
    (clear b399)
    (on b399 b184)
    (on-table b184)
    (clear b110)
    (on-table b110)
    (clear b305)
    (on b305 b200)
    (on b200 b130)
    (on-table b130)
    (clear b306)
    (on b306 b275)
    (on b275 b10)
    (on b10 b248)
    (on b248 b215)
    (on-table b215)
    (clear b333)
    (on b333 b257)
    (on b257 b194)
    (on-table b194)
    (clear b86)
    (on b86 b159)
    (on b159 b404)
    (on b404 b129)
    (on-table b129)
    (clear b304)
    (on b304 b211)
    (on b211 b114)
    (on-table b114)
    (clear b256)
    (on-table b256)
    (clear b282)
    (on b282 b362)
    (on-table b362)
    (clear b133)
    (on b133 b326)
    (on b326 b154)
    (on b154 b50)
    (on b50 b300)
    (on-table b300)
    (clear b241)
    (on b241 b296)
    (on-table b296)
    (clear b203)
    (on-table b203)
    (clear b361)
    (on-table b361)
    (clear b246)
    (on-table b246)
    (clear b122)
    (on b122 b108)
    (on b108 b43)
    (on b43 b158)
    (on-table b158)
    (clear b39)
    (on-table b39)
    (clear b51)
    (on-table b51)
    (clear b199)
    (on b199 b148)
    (on b148 b74)
    (on b74 b406)
    (on b406 b57)
    (on b57 b173)
    (on b173 b65)
    (on b65 b6)
    (on b6 b16)
    (on b16 b102)
    (on b102 b164)
    (on b164 b77)
    (on b77 b36)
    (on-table b36)
    (clear b83)
    (on b83 b368)
    (on b368 b272)
    (on-table b272)
    (clear b238)
    (on b238 b334)
    (on b334 b342)
    (on-table b342)
    (clear b279)
    (on-table b279)
    (clear b328)
    (on b328 b278)
    (on b278 b270)
    (on b270 b24)
    (on-table b24)
    (clear b20)
    (on b20 b255)
    (on b255 b103)
    (on b103 b293)
    (on b293 b327)
    (on-table b327)
    (clear b251)
    (on b251 b260)
    (on b260 b376)
    (on b376 b227)
    (on b227 b79)
    (on-table b79)
    (clear b395)
    (on-table b395)
    (clear b174)
    (on b174 b303)
    (on b303 b52)
    (on-table b52)
    (clear b369)
    (on b369 b81)
    (on-table b81)
    (clear b323)
    (on-table b323)
    (clear b234)
    (on b234 b209)
    (on b209 b311)
    (on b311 b310)
    (on b310 b189)
    (on b189 b314)
    (on b314 b33)
    (on-table b33)
    (clear b233)
    (on b233 b141)
    (on b141 b411)
    (on-table b411)
    (clear b3)
    (on b3 b206)
    (on b206 b220)
    (on-table b220)
    (clear b140)
    (on b140 b372)
    (on b372 b178)
    (on b178 b30)
    (on-table b30)
    (clear b2)
    (on b2 b182)
    (on-table b182)
    (clear b124)
    (on b124 b31)
    (on-table b31)
    (clear b88)
    (on b88 b335)
    (on-table b335)
    (clear b309)
    (on b309 b187)
    (on-table b187)
    (clear b302)
    (on-table b302)
    (clear b28)
    (on b28 b208)
    (on b208 b171)
    (on-table b171)
    (clear b64)
    (on-table b64)
    (clear b41)
    (on b41 b38)
    (on b38 b172)
    (on b172 b355)
    (on b355 b207)
    (on b207 b76)
    (on b76 b120)
    (on b120 b370)
    (on b370 b285)
    (on b285 b338)
    (on-table b338)
    (clear b358)
    (on b358 b403)
    (on b403 b145)
    (on b145 b27)
    (on b27 b221)
    (on b221 b360)
    (on b360 b377)
    (on-table b377)
    (clear b307)
    (on b307 b259)
    (on b259 b142)
    (on b142 b250)
    (on b250 b280)
    (on-table b280)
    (clear b123)
    (on-table b123)
    (clear b5)
    (on b5 b55)
    (on-table b55)
    (clear b330)
    (on b330 b101)
    (on b101 b379)
    (on b379 b245)
    (on b245 b37)
    (on b37 b397)
    (on b397 b235)
    (on b235 b269)
    (on b269 b4)
    (on b4 b316)
    (on b316 b405)
    (on b405 b213)
    (on b213 b364)
    (on b364 b29)
    (on-table b29)
    (clear b156)
    (on b156 b127)
    (on b127 b134)
    (on b134 b176)
    (on b176 b236)
    (on b236 b115)
    (on b115 b281)
    (on b281 b163)
    (on b163 b320)
    (on-table b320)
    (clear b67)
    (on b67 b190)
    (on-table b190)
    (clear b112)
    (on b112 b23)
    (on b23 b106)
    (on b106 b205)
    (on b205 b70)
    (on b70 b197)
    (on b197 b322)
    (on b322 b286)
    (on b286 b400)
    (on-table b400)
    (clear b89)
    (on-table b89)
    (clear b352)
    (on-table b352)
    (clear b131)
    (on b131 b188)
    (on b188 b97)
    (on b97 b374)
    (on b374 b343)
    (on-table b343)
    (clear b165)
    (on b165 b339)
    (on b339 b170)
    (on b170 b378)
    (on b378 b273)
    (on-table b273)
    (clear b71)
    (on b71 b98)
    (on b98 b117)
    (on b117 b380)
    (on-table b380)
    (clear b244)
    (on b244 b263)
    (on b263 b226)
    (on b226 b298)
    (on b298 b147)
    (on b147 b276)
    (on b276 b167)
    (on-table b167)
    (clear b384)
    (on b384 b8)
    (on-table b8)
    (clear b336)
    (on-table b336)
    (clear b193)
    (on b193 b225)
    (on-table b225)
    (clear b113)
    (on-table b113)
    (clear b161)
    (on-table b161)
    (clear b347)
    (on b347 b84)
    (on b84 b252)
    (on b252 b313)
    (on b313 b371)
    (on b371 b249)
    (on b249 b72)
    (on-table b72)
    (clear b354)
    (on b354 b274)
    (on-table b274)
    (clear b214)
    (on b214 b237)
    (on b237 b80)
    (on b80 b75)
    (on-table b75)
    (clear b345)
    (on b345 b48)
    (on-table b48)
    (clear b319)
    (on b319 b93)
    (on b93 b267)
    (on b267 b9)
    (on b9 b321)
    (on b321 b410)
    (on b410 b324)
    (on b324 b394)
    (on b394 b219)
    (on b219 b217)
    (on b217 b157)
    (on b157 b253)
    (on b253 b116)
    (on b116 b61)
    (on b61 b348)
    (on-table b348)
    (clear b393)
    (on b393 b204)
    (on b204 b271)
    (on b271 b104)
    (on-table b104)
    (clear b239)
    (on b239 b243)
    (on b243 b58)
    (on-table b58)
    (clear b143)
    (on b143 b224)
    (on b224 b292)
    (on b292 b73)
    (on b73 b201)
    (on b201 b283)
    (on b283 b337)
    (on b337 b277)
    (on b277 b341)
    (on b341 b45)
    (on b45 b153)
    (on b153 b247)
    (on b247 b105)
    (on b105 b49)
    (on-table b49)
    (clear b222)
    (on b222 b179)
    (on b179 b175)
    (on b175 b290)
    (on b290 b346)
    (on-table b346)
    (clear b44)
    (on b44 b387)
    (on b387 b54)
    (on-table b54)
    (clear b242)
    (on-table b242)
    (clear b95)
    (on b95 b40)
    (on b40 b138)
    (on b138 b181)
    (on b181 b402)
    (on b402 b312)
    (on-table b312)
    (clear b126)
    (on b126 b350)
    (on b350 b407)
    (on b407 b109)
    (on b109 b149)
    (on-table b149)
    (clear b160)
    (on b160 b289)
    (on b289 b297)
    (on b297 b198)
    (on b198 b26)
    (on b26 b218)
    (on-table b218)
    (clear b357)
    (on b357 b396)
    (on b396 b268)
    (on b268 b216)
    (on b216 b166)
    (on b166 b14)
    (on b14 b381)
    (on b381 b63)
    (on b63 b22)
    (on b22 b137)
    (on b137 b295)
    (on b295 b121)
    (on b121 b144)
    (on b144 b288)
    (on-table b288)
    (clear b53)
    (on b53 b85)
    (on-table b85)
    (clear b212)
    (on b212 b139)
    (on b139 b34)
    (on b34 b180)
    (on b180 b325)
    (on b325 b25)
    (on b25 b17)
    (on b17 b118)
    (on-table b118)
    (clear b287)
    (on-table b287)
    (clear b344)
    (on b344 b169)
    (on-table b169)
    (clear b132)
    (on b132 b351)
    (on b351 b373)
    (on b373 b386)
    (on b386 b261)
    (on b261 b365)
    (on-table b365)
    (clear b388)
    (on-table b388)
    (clear b228)
    (on b228 b47)
    (on b47 b100)
    (on b100 b21)
    (on-table b21)
    (clear b135)
    (on b135 b363)
    (on b363 b15)
    (on b15 b366)
    (on b366 b107)
    (on b107 b12)
    (on b12 b62)
    (on b62 b353)
    (on b353 b230)
    (on-table b230)
    (clear b125)
    (on b125 b192)
    (on b192 b13)
    (on b13 b367)
    (on-table b367)
    (clear b409)
    (on b409 b210)
    (on b210 b151)
    (on b151 b391)
    (on b391 b19)
    (on b19 b92)
    (on-table b92))
 (:goal  (and 
    (clear b9)
    (on b9 b8)
    (on b8 b1)
    (on-table b1)
    (clear b10)
    (on-table b10)
    (clear b7)
    (on b7 b6)
    (on b6 b5)
    (on b5 b3)
    (on b3 b2)
    (on b2 b11)
    (on b11 b12)
    (on-table b12)
    (clear b4)
    (on-table b4))))

; plan
1. (unstack b135 b363)
   deleted: (on b135 b363) (clear b135) (arm-empty)
   added: (holding b135) (clear b363)
   goals met: 0 of 16
2. (putdown b135)
   deleted: (holding b135)
   added: (clear b135) (arm-empty) (on-table b135)
   goals met: 0 of 16
3. (unstack b146 b7)
   deleted: (on b146 b7) (clear b146) (arm-empty)
   added: (holding b146) (clear b7)
   goals met: 1 of 16
4. (putdown b146)
   deleted: (holding b146)
   added: (clear b146) (arm-empty) (on-table b146)
   goals met: 1 of 16
5. (unstack b199 b148)
   deleted: (on b199 b148) (clear b199) (arm-empty)
   added: (holding b199) (clear b148)
   goals met: 1 of 16
6. (putdown b199)
   deleted: (holding b199)
   added: (clear b199) (arm-empty) (on-table b199)
   goals met: 1 of 16
7. (unstack b148 b74)
   deleted: (on b148 b74) (clear b148) (arm-empty)
   added: (holding b148) (clear b74)
   goals met: 1 of 16
8. (putdown b148)
   deleted: (holding b148)
   added: (clear b148) (arm-empty) (on-table b148)
   goals met: 1 of 16
9. (unstack b294 b11)
   deleted: (on b294 b11) (clear b294) (arm-empty)
   added: (holding b294) (clear b11)
   goals met: 1 of 16
10. (putdown b294)
   deleted: (holding b294)
   added: (clear b294) (arm-empty) (on-table b294)
   goals met: 1 of 16
11. (unstack b306 b275)
   deleted: (on b306 b275) (clear b306) (arm-empty)
   added: (holding b306) (clear b275)
   goals met: 1 of 16
12. (putdown b306)
   deleted: (holding b306)
   added: (clear b306) (arm-empty) (on-table b306)
   goals met: 1 of 16
13. (unstack b275 b10)
   deleted: (on b275 b10) (clear b275) (arm-empty)
   added: (holding b275) (clear b10)
   goals met: 2 of 16
14. (putdown b275)
   deleted: (holding b275)
   added: (clear b275) (arm-empty) (on-table b275)
   goals met: 2 of 16
15. (unstack b10 b248)
   deleted: (on b10 b248) (clear b10) (arm-empty)
   added: (holding b10) (clear b248)
   goals met: 1 of 16
16. (putdown b10)
   deleted: (holding b10)
   added: (clear b10) (arm-empty) (on-table b10)
   goals met: 3 of 16
17. (unstack b319 b93)
   deleted: (on b319 b93) (clear b319) (arm-empty)
   added: (holding b319) (clear b93)
   goals met: 3 of 16
18. (putdown b319)
   deleted: (holding b319)
   added: (clear b319) (arm-empty) (on-table b319)
   goals met: 3 of 16
19. (unstack b330 b101)
   deleted: (on b330 b101) (clear b330) (arm-empty)
   added: (holding b330) (clear b101)
   goals met: 3 of 16
20. (putdown b330)
   deleted: (holding b330)
   added: (clear b330) (arm-empty) (on-table b330)
   goals met: 3 of 16
21. (unstack b101 b379)
   deleted: (on b101 b379) (clear b101) (arm-empty)
   added: (holding b101) (clear b379)
   goals met: 3 of 16
22. (putdown b101)
   deleted: (holding b101)
   added: (clear b101) (arm-empty) (on-table b101)
   goals met: 3 of 16
23. (unstack b363 b15)
   deleted: (on b363 b15) (clear b363) (arm-empty)
   added: (holding b363) (clear b15)
   goals met: 3 of 16
24. (putdown b363)
   deleted: (holding b363)
   added: (clear b363) (arm-empty) (on-table b363)
   goals met: 3 of 16
25. (unstack b15 b366)
   deleted: (on b15 b366) (clear b15) (arm-empty)
   added: (holding b15) (clear b366)
   goals met: 3 of 16
26. (putdown b15)
   deleted: (holding b15)
   added: (clear b15) (arm-empty) (on-table b15)
   goals met: 3 of 16
27. (unstack b366 b107)
   deleted: (on b366 b107) (clear b366) (arm-empty)
   added: (holding b366) (clear b107)
   goals met: 3 of 16
28. (putdown b366)
   deleted: (holding b366)
   added: (clear b366) (arm-empty) (on-table b366)
   goals met: 3 of 16
29. (unstack b107 b12)
   deleted: (on b107 b12) (clear b107) (arm-empty)
   added: (holding b107) (clear b12)
   goals met: 3 of 16
30. (putdown b107)
   deleted: (holding b107)
   added: (clear b107) (arm-empty) (on-table b107)
   goals met: 3 of 16
31. (unstack b12 b62)
   deleted: (on b12 b62) (clear b12) (arm-empty)
   added: (holding b12) (clear b62)
   goals met: 3 of 16
32. (putdown b12)
   deleted: (holding b12)
   added: (clear b12) (arm-empty) (on-table b12)
   goals met: 4 of 16
33. (unstack b379 b245)
   deleted: (on b379 b245) (clear b379) (arm-empty)
   added: (holding b379) (clear b245)
   goals met: 4 of 16
34. (putdown b379)
   deleted: (holding b379)
   added: (clear b379) (arm-empty) (on-table b379)
   goals met: 4 of 16
35. (unstack b245 b37)
   deleted: (on b245 b37) (clear b245) (arm-empty)
   added: (holding b245) (clear b37)
   goals met: 4 of 16
36. (putdown b245)
   deleted: (holding b245)
   added: (clear b245) (arm-empty) (on-table b245)
   goals met: 4 of 16
37. (unstack b37 b397)
   deleted: (on b37 b397) (clear b37) (arm-empty)
   added: (holding b37) (clear b397)
   goals met: 4 of 16
38. (putdown b37)
   deleted: (holding b37)
   added: (clear b37) (arm-empty) (on-table b37)
   goals met: 4 of 16
39. (unstack b384 b8)
   deleted: (on b384 b8) (clear b384) (arm-empty)
   added: (holding b384) (clear b8)
   goals met: 4 of 16
40. (putdown b384)
   deleted: (holding b384)
   added: (clear b384) (arm-empty) (on-table b384)
   goals met: 4 of 16
41. (unstack b397 b235)
   deleted: (on b397 b235) (clear b397) (arm-empty)
   added: (holding b397) (clear b235)
   goals met: 4 of 16
42. (putdown b397)
   deleted: (holding b397)
   added: (clear b397) (arm-empty) (on-table b397)
   goals met: 4 of 16
43. (unstack b235 b269)
   deleted: (on b235 b269) (clear b235) (arm-empty)
   added: (holding b235) (clear b269)
   goals met: 4 of 16
44. (putdown b235)
   deleted: (holding b235)
   added: (clear b235) (arm-empty) (on-table b235)
   goals met: 4 of 16
45. (unstack b269 b4)
   deleted: (on b269 b4) (clear b269) (arm-empty)
   added: (holding b269) (clear b4)
   goals met: 5 of 16
46. (putdown b269)
   deleted: (holding b269)
   added: (clear b269) (arm-empty) (on-table b269)
   goals met: 5 of 16
47. (unstack b4 b316)
   deleted: (on b4 b316) (clear b4) (arm-empty)
   added: (holding b4) (clear b316)
   goals met: 4 of 16
48. (putdown b4)
   deleted: (holding b4)
   added: (clear b4) (arm-empty) (on-table b4)
   goals met: 6 of 16
49. (unstack b74 b406)
   deleted: (on b74 b406) (clear b74) (arm-empty)
   added: (holding b74) (clear b406)
   goals met: 6 of 16
50. (putdown b74)
   deleted: (holding b74)
   added: (clear b74) (arm-empty) (on-table b74)
   goals met: 6 of 16
51. (unstack b406 b57)
   deleted: (on b406 b57) (clear b406) (arm-empty)
   added: (holding b406) (clear b57)
   goals met: 6 of 16
52. (putdown b406)
   deleted: (holding b406)
   added: (clear b406) (arm-empty) (on-table b406)
   goals met: 6 of 16
53. (unstack b57 b173)
   deleted: (on b57 b173) (clear b57) (arm-empty)
   added: (holding b57) (clear b173)
   goals met: 6 of 16
54. (putdown b57)
   deleted: (holding b57)
   added: (clear b57) (arm-empty) (on-table b57)
   goals met: 6 of 16
55. (unstack b173 b65)
   deleted: (on b173 b65) (clear b173) (arm-empty)
   added: (holding b173) (clear b65)
   goals met: 6 of 16
56. (putdown b173)
   deleted: (holding b173)
   added: (clear b173) (arm-empty) (on-table b173)
   goals met: 6 of 16
57. (unstack b65 b6)
   deleted: (on b65 b6) (clear b65) (arm-empty)
   added: (holding b65) (clear b6)
   goals met: 6 of 16
58. (putdown b65)
   deleted: (holding b65)
   added: (clear b65) (arm-empty) (on-table b65)
   goals met: 6 of 16
59. (unstack b93 b267)
   deleted: (on b93 b267) (clear b93) (arm-empty)
   added: (holding b93) (clear b267)
   goals met: 6 of 16
60. (putdown b93)
   deleted: (holding b93)
   added: (clear b93) (arm-empty) (on-table b93)
   goals met: 6 of 16
61. (unstack b267 b9)
   deleted: (on b267 b9) (clear b267) (arm-empty)
   added: (holding b267) (clear b9)
   goals met: 7 of 16
62. (putdown b267)
   deleted: (holding b267)
   added: (clear b267) (arm-empty) (on-table b267)
   goals met: 7 of 16
63. (unstack b11 b356)
   deleted: (on b11 b356) (clear b11) (arm-empty)
   added: (holding b11) (clear b356)
   goals met: 7 of 16
64. (stack b11 b12)
   deleted: (clear b12) (holding b11)
   added: (arm-empty) (clear b11) (on b11 b12)
   goals met: 8 of 16
65. (unstack b7 b266)
   deleted: (on b7 b266) (clear b7) (arm-empty)
   added: (holding b7) (clear b266)
   goals met: 7 of 16
66. (stack b7 b6)
   deleted: (clear b6) (holding b7)
   added: (arm-empty) (clear b7) (on b7 b6)
   goals met: 9 of 16
67. (unstack b266 b375)
   deleted: (on b266 b375) (clear b266) (arm-empty)
   added: (holding b266) (clear b375)
   goals met: 9 of 16
68. (putdown b266)
   deleted: (holding b266)
   added: (clear b266) (arm-empty) (on-table b266)
   goals met: 9 of 16
69. (unstack b375 b42)
   deleted: (on b375 b42) (clear b375) (arm-empty)
   added: (holding b375) (clear b42)
   goals met: 9 of 16
70. (putdown b375)
   deleted: (holding b375)
   added: (clear b375) (arm-empty) (on-table b375)
   goals met: 9 of 16
71. (unstack b42 b196)
   deleted: (on b42 b196) (clear b42) (arm-empty)
   added: (holding b42) (clear b196)
   goals met: 9 of 16
72. (putdown b42)
   deleted: (holding b42)
   added: (clear b42) (arm-empty) (on-table b42)
   goals met: 9 of 16
73. (unstack b196 b195)
   deleted: (on b196 b195) (clear b196) (arm-empty)
   added: (holding b196) (clear b195)
   goals met: 9 of 16
74. (putdown b196)
   deleted: (holding b196)
   added: (clear b196) (arm-empty) (on-table b196)
   goals met: 9 of 16
75. (unstack b195 b136)
   deleted: (on b195 b136) (clear b195) (arm-empty)
   added: (holding b195) (clear b136)
   goals met: 9 of 16
76. (putdown b195)
   deleted: (holding b195)
   added: (clear b195) (arm-empty) (on-table b195)
   goals met: 9 of 16
77. (unstack b136 b90)
   deleted: (on b136 b90) (clear b136) (arm-empty)
   added: (holding b136) (clear b90)
   goals met: 9 of 16
78. (putdown b136)
   deleted: (holding b136)
   added: (clear b136) (arm-empty) (on-table b136)
   goals met: 9 of 16
79. (unstack b90 b68)
   deleted: (on b90 b68) (clear b90) (arm-empty)
   added: (holding b90) (clear b68)
   goals met: 9 of 16
80. (putdown b90)
   deleted: (holding b90)
   added: (clear b90) (arm-empty) (on-table b90)
   goals met: 9 of 16
81. (unstack b68 b331)
   deleted: (on b68 b331) (clear b68) (arm-empty)
   added: (holding b68) (clear b331)
   goals met: 9 of 16
82. (putdown b68)
   deleted: (holding b68)
   added: (clear b68) (arm-empty) (on-table b68)
   goals met: 9 of 16
83. (unstack b331 b291)
   deleted: (on b331 b291) (clear b331) (arm-empty)
   added: (holding b331) (clear b291)
   goals met: 9 of 16
84. (putdown b331)
   deleted: (holding b331)
   added: (clear b331) (arm-empty) (on-table b331)
   goals met: 9 of 16
85. (unstack b291 b191)
   deleted: (on b291 b191) (clear b291) (arm-empty)
   added: (holding b291) (clear b191)
   goals met: 9 of 16
86. (putdown b291)
   deleted: (holding b291)
   added: (clear b291) (arm-empty) (on-table b291)
   goals met: 9 of 16
87. (unstack b191 b359)
   deleted: (on b191 b359) (clear b191) (arm-empty)
   added: (holding b191) (clear b359)
   goals met: 9 of 16
88. (putdown b191)
   deleted: (holding b191)
   added: (clear b191) (arm-empty) (on-table b191)
   goals met: 9 of 16
89. (unstack b359 b1)
   deleted: (on b359 b1) (clear b359) (arm-empty)
   added: (holding b359) (clear b1)
   goals met: 9 of 16
90. (putdown b359)
   deleted: (holding b359)
   added: (clear b359) (arm-empty) (on-table b359)
   goals met: 9 of 16
91. (unstack b1 b162)
   deleted: (on b1 b162) (clear b1) (arm-empty)
   added: (holding b1) (clear b162)
   goals met: 9 of 16
92. (putdown b1)
   deleted: (holding b1)
   added: (clear b1) (arm-empty) (on-table b1)
   goals met: 10 of 16
93. (unstack b2 b182)
   deleted: (on b2 b182) (clear b2) (arm-empty)
   added: (holding b2) (clear b182)
   goals met: 10 of 16
94. (stack b2 b11)
   deleted: (clear b11) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b11)
   goals met: 11 of 16
95. (unstack b3 b206)
   deleted: (on b3 b206) (clear b3) (arm-empty)
   added: (holding b3) (clear b206)
   goals met: 11 of 16
96. (stack b3 b2)
   deleted: (clear b2) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b2)
   goals met: 12 of 16
97. (unstack b5 b55)
   deleted: (on b5 b55) (clear b5) (arm-empty)
   added: (holding b5) (clear b55)
   goals met: 12 of 16
98. (stack b5 b3)
   deleted: (clear b3) (holding b5)
   added: (arm-empty) (clear b5) (on b5 b3)
   goals met: 13 of 16
99. (pickup b8)
   deleted: (clear b8) (on-table b8) (arm-empty)
   added: (holding b8)
   goals met: 13 of 16
100. (stack b8 b1)
   deleted: (clear b1) (holding b8)
   added: (arm-empty) (clear b8) (on b8 b1)
   goals met: 14 of 16
101. (unstack b9 b321)
   deleted: (on b9 b321) (clear b9) (arm-empty)
   added: (holding b9) (clear b321)
   goals met: 13 of 16
102. (stack b9 b8)
   deleted: (clear b8) (holding b9)
   added: (arm-empty) (clear b9) (on b9 b8)
   goals met: 15 of 16
103. (unstack b7 b6)
   deleted: (on b7 b6) (clear b7) (arm-empty)
   added: (holding b7) (clear b6)
   goals met: 13 of 16
104. (putdown b7)
   deleted: (holding b7)
   added: (clear b7) (arm-empty) (on-table b7)
   goals met: 14 of 16
105. (unstack b6 b16)
   deleted: (on b6 b16) (clear b6) (arm-empty)
   added: (holding b6) (clear b16)
   goals met: 14 of 16
106. (stack b6 b5)
   deleted: (clear b5) (holding b6)
   added: (arm-empty) (clear b6) (on b6 b5)
   goals met: 15 of 16
107. (pickup b7)
   deleted: (clear b7) (on-table b7) (arm-empty)
   added: (holding b7)
   goals met: 14 of 16
108. (stack b7 b6)
   deleted: (clear b6) (holding b7)
   added: (arm-empty) (clear b7) (on b7 b6)
   goals met: 16 of 16
